
# Лаборатория
# 1. Осуществить ввод адреса Интернет-страницы.
# 2. Осуществить поиск всех изображений на странице.
# 3. Удалить дубликаты.
# 4. Удалить адреса без http или https.
# 5. Вывести адреса изображений с нумерацией, нумерацию изображений начинать с 1.
# 6. Потоками осуществить загрузку изображений и информацию о загрузке вывести на экран отдельными строками
# 7. В случае невозможности загрузки выводить 'error'.

# Пример входных данных:
# https://ya.ru/

# Пример выходных данных:
# 1 izobrazhenie https://mc.yandex.ru/watch/723233
# Potok 1 zakonchil zagruzku https://mc.yandex.ru/watch/723233

